PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_pdm_pcm.h
/** \} group_pdm_pcm_data_structures */


/** \cond INTERNAL */
/******************************************************************************
 * Local definitions
*******************************************************************************/
/** Define bit mask for all available interrupt sources */
#define CY_PDM_PCM_INTR_MASK        (CY_PDM_PCM_INTR_RX_TRIGGER   | \
                                     CY_PDM_PCM_INTR_RX_NOT_EMPTY | \
                                     CY_PDM_PCM_INTR_RX_OVERFLOW  | \
                                     CY_PDM_PCM_INTR_RX_UNDERFLOW)

/* Non-zero default values */
#define CY_PDM_PCM_CTL_PGA_R_DEFAULT    (0x8U)
#define CY_PDM_PCM_CTL_PGA_L_DEFAULT    (0x8U)
#define CY_PDM_PCM_CTL_STEP_SEL_DEFAULT (0x1U)

#define CY_PDM_PCM_CTL_DEFAULT (_VAL2FLD(PDM_CTL_PGA_R, CY_PDM_PCM_CTL_PGA_R_DEFAULT) | \
                                _VAL2FLD(PDM_CTL_PGA_L, CY_PDM_PCM_CTL_PGA_L_DEFAULT) | \
                                _VAL2FLD(PDM_CTL_STEP_SEL, CY_PDM_PCM_CTL_STEP_SEL_DEFAULT))

#define CY_PDM_PCM_CLOCK_CTL_MCLKQ_CLOCK_DIV_DEFAULT (0x1U)
#define CY_PDM_PCM_CLOCK_CTL_CKO_CLOCK_DIV_DEFAULT   (0x3U)
#define CY_PDM_PCM_CLOCK_CTL_SINC_RATE_DEFAULT       (0x20U)

#define CY_PDM_PCM_CLOCK_CTL_DEFAULT (_VAL2FLD(PDM_CLOCK_CTL_MCLKQ_CLOCK_DIV, CY_PDM_PCM_CLOCK_CTL_MCLKQ_CLOCK_DIV_DEFAULT) | \
                                      _VAL2FLD(PDM_CLOCK_CTL_CKO_CLOCK_DIV, CY_PDM_PCM_CLOCK_CTL_CKO_CLOCK_DIV_DEFAULT)     | \
                                      _VAL2FLD(PDM_CLOCK_CTL_SINC_RATE, CY_PDM_PCM_CLOCK_CTL_SINC_RATE_DEFAULT))

#define CY_PDM_PCM_MODE_CTL_PCM_CH_SET_DEFAULT (0x3U)
#define CY_PDM_PCM_MODE_CTL_S_CYCLES_DEFAULT   (0x1U)
#define CY_PDM_PCM_MODE_CTL_HPF_GAIN_DEFAULT   (0xBU)
#define CY_PDM_PCM_MODE_CTL_HPF_EN_N_DEFAULT   (0x1U)

#define CY_PDM_PCM_MODE_CTL_DEFAULT (_VAL2FLD(PDM_MODE_CTL_PCM_CH_SET, CY_PDM_PCM_MODE_CTL_PCM_CH_SET_DEFAULT) | \
                                     _VAL2FLD(PDM_MODE_CTL_S_CYCLES, CY_PDM_PCM_MODE_CTL_S_CYCLES_DEFAULT)     | \
                                     _VAL2FLD(PDM_MODE_CTL_HPF_GAIN, CY_PDM_PCM_MODE_CTL_HPF_GAIN_DEFAULT)     | \
                                     _VAL2FLD(PDM_MODE_CTL_HPF_EN_N, CY_PDM_PCM_MODE_CTL_HPF_EN_N_DEFAULT))

/* Macros for conditions used by CY_ASSERT calls */
#define CY_PDM_PCM_IS_CLK_DIV_VALID(clkDiv)    (((clkDiv) == CY_PDM_PCM_CLK_DIV_BYPASS) || \
                                                ((clkDiv) == CY_PDM_PCM_CLK_DIV_1_2)    || \
                                                ((clkDiv) == CY_PDM_PCM_CLK_DIV_1_3)    || \
                                                ((clkDiv) == CY_PDM_PCM_CLK_DIV_1_4))

#define CY_PDM_PCM_IS_CH_SET_VALID(chanSelect) (((chanSelect) == CY_PDM_PCM_OUT_CHAN_LEFT)  || \
                                                ((chanSelect) == CY_PDM_PCM_OUT_CHAN_RIGHT) || \
                                                ((chanSelect) == CY_PDM_PCM_OUT_STEREO))

#define CY_PDM_PCM_IS_GAIN_VALID(gain)         (((gain) == CY_PDM_PCM_ATTN_12_DB)   || \
                                                ((gain) == CY_PDM_PCM_ATTN_10_5_DB) || \
                                                ((gain) == CY_PDM_PCM_ATTN_9_DB)    || \
                                                ((gain) == CY_PDM_PCM_ATTN_7_5_DB)  || \
                                                ((gain) == CY_PDM_PCM_ATTN_6_DB)    || \
                                                ((gain) == CY_PDM_PCM_ATTN_4_5_DB)  || \
                                                ((gain) == CY_PDM_PCM_ATTN_3_DB)    || \
                                                ((gain) == CY_PDM_PCM_ATTN_1_5_DB)  || \
                                                ((gain) == CY_PDM_PCM_BYPASS)       || \
                                                ((gain) == CY_PDM_PCM_GAIN_1_5_DB)  || \
                                                ((gain) == CY_PDM_PCM_GAIN_3_DB)    || \
                                                ((gain) == CY_PDM_PCM_GAIN_4_5_DB)  || \
                                                ((gain) == CY_PDM_PCM_GAIN_6_DB)    || \
                                                ((gain) == CY_PDM_PCM_GAIN_7_5_DB)  || \
                                                ((gain) == CY_PDM_PCM_GAIN_9_DB)    || \
                                                ((gain) == CY_PDM_PCM_GAIN_10_5_DB))

#define CY_PDM_PCM_IS_WORD_LEN_VALID(wordLen)  (((wordLen) == CY_PDM_PCM_WLEN_16_BIT) || \
                                                ((wordLen) == CY_PDM_PCM_WLEN_18_BIT) || \
                                                ((wordLen) == CY_PDM_PCM_WLEN_20_BIT) || \
                                                ((wordLen) == CY_PDM_PCM_WLEN_24_BIT))

#define CY_PDM_PCM_IS_CHAN_VALID(chan)         (((chan) == CY_PDM_PCM_CHAN_LEFT) || \
                                                ((chan) == CY_PDM_PCM_CHAN_RIGHT))

#define CY_PDM_PCM_IS_S_CYCLES_VALID(sCycles)  (((sCycles) == CY_PDM_PCM_SOFT_MUTE_CYCLES_64)  || \
                                                ((sCycles) == CY_PDM_PCM_SOFT_MUTE_CYCLES_96)  || \
                                                ((sCycles) == CY_PDM_PCM_SOFT_MUTE_CYCLES_128) || \
                                                ((sCycles) == CY_PDM_PCM_SOFT_MUTE_CYCLES_160) || \
                                                ((sCycles) == CY_PDM_PCM_SOFT_MUTE_CYCLES_192) || \
                                                ((sCycles) == CY_PDM_PCM_SOFT_MUTE_CYCLES_256) || \
                                                ((sCycles) == CY_PDM_PCM_SOFT_MUTE_CYCLES_384) || \
                                                ((sCycles) == CY_PDM_PCM_SOFT_MUTE_CYCLES_512))

#define CY_PDM_PCM_IS_INTR_MASK_VALID(interrupt)  (0UL == ((interrupt) & ((uint32_t) ~CY_PDM_PCM_INTR_MASK)))
#define CY_PDM_PCM_IS_SINC_RATE_VALID(sincRate)   ((sincRate) <= 127U)
#define CY_PDM_PCM_IS_STEP_SEL_VALID(stepSel)     ((stepSel)  <= 1UL)
#define CY_PDM_PCM_IS_CKO_DELAY_VALID(ckoDelay)   ((ckoDelay) <= 7U)
#define CY_PDM_PCM_IS_HPF_GAIN_VALID(hpfGain)     ((hpfGain)  <= 15U)
#define CY_PDM_PCM_IS_CKO_CLOCK_DIV_VALID(ckoDiv) (((ckoDiv)  >= 1U) && ((ckoDiv) <= 15U))
#define CY_PDM_PCM_IS_TRIG_LEVEL(trigLevel, chanSelect) ((trigLevel) <= (((chanSelect) == CY_PDM_PCM_OUT_STEREO)? 253U : 254U))
/** \endcond */

/**
* \addtogroup group_pdm_pcm_functions
* \{
*/

cy_en_pdm_pcm_status_t   Cy_PDM_PCM_Init(PDM_Type * base, cy_stc_pdm_pcm_config_t const * config);
void     Cy_PDM_PCM_DeInit(PDM_Type * base);
void     Cy_PDM_PCM_SetGain(PDM_Type * base, cy_en_pdm_pcm_chan_select_t chan, cy_en_pdm_pcm_gain_t gain);
cy_en_pdm_pcm_gain_t     Cy_PDM_PCM_GetGain(PDM_Type const * base, cy_en_pdm_pcm_chan_select_t chan);

/** \addtogroup group_pdm_pcm_functions_syspm_callback
* The driver supports SysPm callback for Deep Sleep transition.
* \{
*/
cy_en_syspm_status_t     Cy_PDM_PCM_DeepSleepCallback(cy_stc_syspm_callback_params_t const * callbackParams, cy_en_syspm_callback_mode_t mode);
/** \} */

__STATIC_INLINE void     Cy_PDM_PCM_Enable(PDM_Type * base);
__STATIC_INLINE void     Cy_PDM_PCM_Disable(PDM_Type * base);
__STATIC_INLINE void     Cy_PDM_PCM_SetInterruptMask(PDM_Type * base, uint32_t interrupt);
__STATIC_INLINE uint32_t Cy_PDM_PCM_GetInterruptMask(PDM_Type const * base);
__STATIC_INLINE uint32_t Cy_PDM_PCM_GetInterruptStatusMasked(PDM_Type const * base);
__STATIC_INLINE uint32_t Cy_PDM_PCM_GetInterruptStatus(PDM_Type const * base);
__STATIC_INLINE void     Cy_PDM_PCM_ClearInterrupt(PDM_Type * base, uint32_t interrupt);
__STATIC_INLINE void     Cy_PDM_PCM_SetInterrupt(PDM_Type * base, uint32_t interrupt);
__STATIC_INLINE uint8_t  Cy_PDM_PCM_GetNumInFifo(PDM_Type const * base);
__STATIC_INLINE void     Cy_PDM_PCM_ClearFifo(PDM_Type * base);
__STATIC_INLINE uint32_t Cy_PDM_PCM_ReadFifo(PDM_Type const * base);
__STATIC_INLINE void     Cy_PDM_PCM_EnableSoftMute(PDM_Type * base);
__STATIC_INLINE void     Cy_PDM_PCM_DisableSoftMute(PDM_Type * base);
__STATIC_INLINE void     Cy_PDM_PCM_FreezeFifo(PDM_Type * base);
__STATIC_INLINE void     Cy_PDM_PCM_UnfreezeFifo(PDM_Type * base);
__STATIC_INLINE uint32_t Cy_PDM_PCM_ReadFifoSilent(PDM_Type const * base);


